{"pages":[{"title":"About","text":"mde.tw/eng 內容管理網誌","tags":"misc","url":"http://mde.tw/eng/blog/pages/about/"},{"title":"最低 60 專案計畫","text":"就從現在開始, 沒有人會因為修 KMOLab 所開列的課程而得到比 60 分更低的分數, 真的, 最低就是 60 分. 不要不相信 不要不相信, 來修就知道. 最低 60 專案計畫總共開列了四門課, 分別在五專一下, 大一與大二上下, 分別為計算機程式, 網際內容管理, 電腦輔助設計實習, 協同產品設計實習等, 就這四門, 除非 Fork University 另有指示, 否則就這四門. 為什麼執行這個計畫? 說來話長, 絕對不是因為整個教學生涯已經達到 Down 人的終極總數目標, 也不是對現今台灣技職體系學生的徹底失望, 或者任課教師已經拿到彈性薪資中, 所謂愛佛勒思峰最高標準, 而是體認到全球歷經新冠肺炎疫情時代之後, 對於已經 13 歲以上的網路成年人, 不應該因為修課被 Down, 而延誤了向前衝刺的時程規劃. 有沒有拿到最低 60 的標準要求? 當然有, 為了拿到修課的分數, 第一要件就是能夠搶到修課的機會. 以這四門課都在綜一館八樓電腦輔助設計室開課的情況而言, 電腦總數雖然只有 63 台, 而且妥善率通常只有 8 成, 但是若將可以忍受站著上課的同學也包括在內, 大約可以容納至少 200 人...... 任課教師的保證可信? 一般來說, Fork University 的任何保證都不太能信, 但是來自 KMOLab 的保證, 可信度應該高一些, 因為我們自新冠肺炎疫情時代之後, 終於體認到: 對於已經 13 歲以上的網路成年人, 不應該因為修課被 Down, 而延誤了向前衝刺的時程規劃. 即便體認到大部分 (有人說應該是全部) 修這些課程的學生都只帶著手機來上課, 上課也都不很專心, 也根本沒在學習任何有用的東西, 老師還是保證最低 60？ 沒有錯, 真的是這樣! 結語 抱歉, 因為要求修課的信件從四面八方湧進中, 我們必須先去處理一下...... 什麼......, 有其他課程宣布最低 100 分...... 不要騙人, 在 Fork University 每一門課程只要總平均高於 83 分就無法送出成績, 除非任課教師有辦法製造出一些虛擬的幽靈學生...... 好了好了, 為了 Fork University 的世界排名, 我來想想辦法, 看能不能推出一個由學生自己列印畢業證書的計畫......修課太麻煩了...... 課程主題曲 你的未來是ㄧ張白紙 充滿無限可能 你如何去描繪 如何添加色彩 由你自己決定 (大家一起唱) 最低 60 計畫 是的 最低 60 計畫 Fork University 全球排名最佳 是的 全球排名最佳","tags":"Min60","url":"http://mde.tw/eng/blog/min-60-project.html"},{"title":"高風險聯網設備","text":"前幾天, 感謝校方送來一份通知, 列出系上共有 40 多台所謂的高風險聯網設備. 其中有 8 台 Linux 代理主機必須配合更新套件, 並且限定可連線管理的 IP 位址範圍. Ubuntu 伺服器 設計系目前共有三台實體虛擬主機與一台虛擬代理主機, 四台符號名稱伺服器, 以及兩台虛擬的 WWW 伺服器主機. 其中系上的符號名稱伺服器原先安裝 Ubuntu 18.04, 必須升級為 20.04, 四台符號名稱伺服器與 WWW 伺服器則需要限制 ssh 的連線範圍. 針對非開發版本的 Ubuntu 18.04 可以參考 https://www.linuxtechi.com/upgrade-ubuntu-18-04-lts-to-ubuntu-20-04-lts/ 升級為 20.04. 舊版的 nginx, 若要升級為較新版本, 則可參考 https://devopscraft.com/how-to-compile-nginx-from-source-on-ubuntu-20-04/ 自行編譯安裝. ufw 防火牆 以代理主機而言, 除了限制可連線 ssh 的 IP 範圍外, 還需要讓同區段的電腦可以對 3128 埠號連線; sudo -s ufw status ufw allow from your_ipv4_or_ipv6_ip ufw allow from 2001:288::/16 to any port 22 ufw deny 22 ufw allow from 2001:288::/16 to any port 3128 ufw deny 3128 ufw enable 其次, 若要刪除原先 ufw 的設定可以使用 ufw reset, 若要暫時關閉 ufw, 採用 ufw disable. 符號名稱的部分, 需要限制 port 22 連線外, 必須讓所有主機都能對 port 53 連線: sudo -s ufw status ufw allow from your_ipv4_or_ipv6_ip ufw allow from 2001:288::/16 to any port 22 ufw deny 22 ufw allow 53 ufw enable WWW 伺服器若採用 port 80 與 443 配置, 則需要對所有主機開放, port 5443 若執行 Fossil SCM, 也必須開放, 其他也是對 port 22 有連線範圍的限制. sudo -s ufw status ufw allow from your_ipv4_or_ipv6_ip ufw allow from 2001:288::/16 to any port 22 ufw deny 22 ufw allow 80 ufw allow 443 ufw allow 5443 ufw enable 最後, 則是附上 電腦輔助設計室電腦規劃 與 網路安全 參考資料.","tags":"Network","url":"http://mde.tw/eng/blog/high-risk-networking-devices.html"}]}